art-marks/art_marks_app_api/app/controllers/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks"
---
  def index
    @bookmarks = Bookmark.all

INSERT INTO "bookmarks" ("site_name", "category", "url", "img", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @bookmark = Bookmark.new(bookmark_params)

    if @bookmark.save

UPDATE "bookmarks" SET "description" = $1, "updated_at" = $2 WHERE "bookmarks"."id" = $3  [["description", "esfgdthrtg"], ["updated_at", "2020-02-06 09:04:38.868716"], ["id", 6]]
---
  def update
    @bookmark.update(bookmark_params)

DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 6]]
---
  def destroy
    @bookmark.destroy

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_bookmark
      @bookmark = Bookmark.find(params[:id])